[
  {
    "link": "https://www.allrecipes.com/recipe/128699/famous-chicken-adobo/",
    "name": "Famous Chicken Adobo",
    "ingredients": [
      "2 tablespoons vegetable oil",
      "1 (3 pound) chicken, cut into pieces",
      "1 large onion, quartered and sliced",
      "2 tablespoons minced garlic",
      " 2/3  cup low sodium soy sauce",
      " 1/3  cup white vinegar",
      "1 tablespoon garlic powder",
      "2 teaspoons black pepper",
      "1  bay leaf"
    ],
    "instructions": [
      "Step 1: Heat vegetable oil in a large skillet over medium-high heat. Cook chicken pieces until golden brown, 2 to 3 minutes per side. Transfer chicken to a plate and set aside.",
      "Step 2: Add onion and garlic to the skillet; cook until softened and brown, about 6 minutes.",
      "Step 3: Pour in soy sauce and vinegar and season with garlic powder, black pepper, and bay leaf.",
      "Step 4: Return chicken to pan, increase heat to high, and bring to a boil. Reduce heat to medium-low, cover, and simmer until chicken is tender and cooked through, 35 to 40 minutes."
    ]
  },
  {
    "link": "https://www.allrecipes.com/recipe/212994/pinakbet/",
    "name": "Pinakbet",
    "ingredients": [
      "3 tablespoons olive oil",
      "1  onion, chopped",
      "2 cloves garlic, minced",
      " 1/2 pound pork loin, chopped",
      " 1/2 pound peeled and deveined prawns",
      "salt and pepper to taste",
      "1  tomato, chopped",
      " 1/4 pound zucchini, seeded and cut into bite-size pieces",
      " 1/4 pound fresh okra, ends trimmed",
      " 1/4 pound fresh green beans, trimmed",
      " 1/4 pound eggplant, cut into bite-size pieces",
      "1 small bitter melon, cut into bite-size pieces"
    ],
    "instructions": [
      "Step 1: Heat oil in a large pot over medium heat; stir in onion and garlic and cook until tender, about 5 minutes.",
      "Step 2: Add pork; cook and stir until browned, 5 to 7 minutes.",
      "Step 3: Add prawns; cook and stir until they turn pink, about 5 minutes.",
      "Step 4: Stir in tomato; season with salt and pepper, cover and simmer for 5 minutes.",
      "Step 5: Stir in zucchini, okra, green beans, eggplant, and bitter melon; cover and cook until the vegetables are tender, about 10 minutes."
    ]
  },
  {
    "link": "https://www.allrecipes.com/recipe/204958/pork-sinigang/",
    "name": "Pork Sinigang",
    "ingredients": [
      "1 tablespoon vegetable oil",
      "1 small onion, chopped",
      "1 teaspoon salt",
      "1 (1/2 inch) piece fresh ginger, chopped",
      "2  plum tomatoes, cut into 1/2-inch dice",
      "1 pound bone-in pork chops",
      "4 cups water, more if needed",
      "1 (1.41 ounce) package tamarind soup base (such as Knorr(r))",
      " 1/2 pound fresh green beans, trimmed"
    ],
    "instructions": [
      "Step 1: Heat vegetable oil in a skillet over medium heat. Add onion; cook and stir until softened and translucent, about 5 minutes. Season with salt.",
      "Step 2: Stir in ginger, tomatoes, and pork chops. Cover and reduce heat to medium-low. Turn the pork occasionally, until browned.",
      "Step 3: Pour in water and tamarind soup base. Bring to a boil, then reduce heat and simmer until the pork is tender and cooked through, about 30 minutes.",
      "Step 4: Stir in green beans and cook until tender."
    ]
  },
  {
    "link": "https://www.allrecipes.com/recipe/270708/lumpia-in-the-air-fryer/",
    "name": "Lumpia in the Air Fryer",
    "ingredients": [
      "1 pound Italian hot sausage links",
      " 1/2 cup finely sliced green onions",
      " 1/2 cup finely chopped carrots",
      " 1/2 cup finely chopped water chestnuts",
      " 1/4 cup diced onions",
      "2 cloves garlic, minced",
      "2 tablespoons soy sauce",
      " 1/2 teaspoon salt",
      " 1/4 teaspoon ground ginger",
      "16  spring roll wrappers",
      "avocado oil cooking spray"
    ],
    "instructions": [
      "Step 1: Remove casing from sausage and cook in a skillet over medium heat until slightly browned, 4 to 5 minutes. Add green onions, carrots, water chestnuts, and onion. Cook and stir until onions are soft and translucent, 5 to 7 minutes. Add garlic and cook for 1 to 2 minutes. Season with soy sauce, salt, and ginger. Stir until filling is well combined; remove from heat.",
      "Step 2: Lay a spring roll wrapper at an angle. Place a scant 1/4 cup filling in the center of the wrapper. Fold bottom corner over filling and tuck in the sides to form a roll. Use your finger to lightly moisten edges with water. Repeat with remaining wrappers and filling. Mist each roll with avocado oil cooking spray.",
      "Step 3: Preheat an air fryer to 390 degrees F (198 degrees C).",
      "Step 4: Place lumpia rolls in the air fryer basket, making sure they are not touching; cook in batches if necessary. Fry for 4 minutes; flip and cook until skins are crispy, about 4 minutes more."
    ]
  },
  {
    "link": "https://www.allrecipes.com/recipe/212911/filipino-beef-steak/",
    "name": "Filipino Beef Steak",
    "ingredients": [
      "4 pounds New York strip steak, sliced thin",
      "1  lemon, juiced",
      "3 tablespoons soy sauce",
      "1 teaspoon white sugar",
      "salt and pepper to taste",
      "1 tablespoon cornstarch",
      " 1/4 cup vegetable oil",
      "3 tablespoons olive oil",
      "1  onion, chopped",
      "2 cloves garlic, chopped"
    ],
    "instructions": [
      "Step 1: Place sliced beef in a large bowl. Whisk together lemon juice, soy sauce, sugar, salt, and pepper in a small bowl; pour over beef and toss to coat. Stir in cornstarch. Cover and refrigerate for 1 hour to overnight.",
      "Step 2: Heat vegetable oil in a large skillet over medium heat.",
      "Step 3: Remove beef slices from marinade, shaking to remove any excess liquid. Discard marinade.",
      "Step 4: Working in batches, fry beef slices in hot oil until they start to firm and are reddish-pink and juicy in the center, 2 to 4 minutes per side. Transfer beef slices to a serving platter.",
      "Step 5: Heat olive oil in a small skillet over medium heat. Cook and stir onion and garlic in hot oil until onion is golden brown, 5 to 7 minutes; spoon over beef slices."
    ]
  },
  {
    "link": "https://www.allrecipes.com/recipe/212923/adobong-pusit-squid-adobo/",
    "name": "Adobong Pusit (Squid Adobo)",
    "ingredients": [
      "2  1/4 pounds squid, cleaned",
      " 1/2 cup white vinegar",
      " 1/2 cup water",
      "salt and ground black pepper to taste",
      "2 tablespoons olive oil",
      "1 small onion, minced",
      "2 cloves garlic, minced",
      "1  tomato, chopped",
      "1 tablespoon soy sauce"
    ],
    "instructions": [
      "Step 1: Combine squid, vinegar, and water in a small pot over medium heat; season with salt and pepper. Simmer for 10 minutes.",
      "Step 2: Meanwhile, heat olive oil in a saucepan over medium heat; cook and stir onion and garlic in hot oil until softened, 5 to 7 minutes. Stir in tomato and soy sauce.",
      "Step 3: Pour squid mixture into tomato mixture and bring to a simmer; cook for 20 minutes."
    ]
  },
  {
    "link": "https://www.allrecipes.com/recipe/204821/ginataang-manok-chicken-cooked-in-coconut-milk/",
    "name": "Ginataang Manok (Chicken Cooked in Coconut Milk)",
    "ingredients": [
      "3 tablespoons canola oil",
      " 1/2 cup sliced fresh ginger",
      "1 (5 pound) whole chicken, cut into pieces",
      "salt and ground black pepper to taste",
      "2 (14 ounce) cans coconut milk",
      "1 (10 ounce) package frozen chopped spinach, thawed and drained"
    ],
    "instructions": [
      "Step 1: Heat oil in a large skillet over medium heat and stir in ginger. Cook and stir until fragrant and lightly browned. Remove ginger and set aside.",
      "Step 2: Season chicken with salt and pepper. Place chicken in the same skillet over medium-high heat without crowding. Cook until chicken is lightly brown on all sides.",
      "Step 3: Return ginger to the skillet and add coconut milk. Bring to a boil, then cover with the lid tilted to allow steam to escape. Reduce heat to medium-low and simmer, stirring occasionally, until chicken is no longer pink at the bone, about 30 minutes.",
      "Step 4: Stir in spinach and simmer uncovered until spinach is warmed through, 8 to 12 minutes. Season with salt and pepper."
    ]
  },
  {
    "link": "https://www.allrecipes.com/recipe/237899/filippino-lechon-kawali/",
    "name": "Filipino Lechon Kawali",
    "ingredients": [
      "1  1/2 pounds pork belly, cut into small pieces",
      "3 cloves garlic, crushed",
      "2  bay leaves",
      " 1/2 teaspoon salt",
      " 1/2 teaspoon ground black pepper",
      "2 cups oil for frying, or as needed"
    ],
    "instructions": [
      "Step 1: Gather all ingredients.",
      "Step 2: Combine pork belly, garlic, bay leaves, salt, and pepper in a skillet; pour in enough water to cover. Bring to a boil, reduce heat, and simmer until skin is tender, 35 to 45 minutes.",
      "Step 3: Drain and let sit at room temperature until pork has air-dried.",
      "Step 4: Heat oil in a deep-fryer or large saucepan to 350 degrees F (175 degrees C).",
      "Step 5: Fry pork in the hot oil, working in batches, until golden brown, 3 to 5 minutes.",
      "Step 6: Remove fried pork with a slotted spoon and drain on a paper towel-lined plate.",
      "Step 7: We have determined the nutritional value of oil for frying based on a retention value of 10% after cooking. The exact amount will vary depending on cooking time and temperature, ingredient density, and the specific type of oil used."
    ]
  },
  {
    "link": "https://www.allrecipes.com/recipe/265040/filipino-beef-giniling-afritada-style/",
    "name": "Filipino Beef Giniling (Afritada Style)",
    "ingredients": [
      "1 tablespoon oil, or as needed",
      "1 clove garlic, minced",
      "2 pounds ground beef",
      "1  1/2 cups water, divided, or more as needed",
      "ground black pepper to taste",
      "2 medium red potatoes, cubed",
      "10  baby carrots, or more to taste, cubed",
      "6 tablespoons soy sauce, divided",
      " 1/2 cup raisins, or more to taste",
      "1  1/2 (6.5 ounce) cans tomato sauce with salt (such as Contadina(r))",
      " 1/2 medium orange bell pepper, diced",
      "4 tablespoons white sugar"
    ],
    "instructions": [
      "Step 1: Gather all ingredients.",
      "Step 2: Heat oil in a large saucepan over medium heat. Add garlic and cook until fragrant, about 1 minute.",
      "Step 3: Add beef and 1/2 cup water; cook and stir until browned and crumbly, 5 to 7 minutes. Season with black pepper and add more water as needed; do not let beef dry out.",
      "Step 4: Add potatoes, carrots, and 3 tablespoons soy sauce; cook for 4 minutes, adding more water if mixture is too dry. Add raisins and cook for 2 to 3 minutes, again adding water as needed.",
      "Step 5: Pour in one can tomato sauce. Fill the can with water and swirl to remove excess sauce; pour into the saucepan. Stir in remaining 1/2 can sauce until combined. Add more water as needed to create a saucy but not soupy consistency.",
      "Step 6: Stir in bell pepper, sugar, and remaining 3 tablespoons soy sauce. Cook, stirring occasionally and adding water as needed so sauce does not dry out, until all vegetables are tender, about 3 to 5 minutes."
    ]
  },
  {
    "link": "https://www.allrecipes.com/recipe/32010/filipino-lumpia/",
    "name": "Filipino Lumpia",
    "ingredients": [
      "1 (12 ounce) package lumpia wrappers",
      "1 pound ground beef",
      " 1/2 pound ground pork",
      " 1/3  cup finely chopped onion",
      " 1/3  cup finely chopped green bell pepper",
      " 1/3  cup finely chopped carrot",
      "1 quart oil for frying"
    ],
    "instructions": [
      "Step 1: Make sure the lumpia wrappers are completely thawed. Lay several out on a clean dry surface and cover with a damp towel. The wrappers are very thin and the edges will dry out quickly.",
      "Step 2: In a medium bowl, blend together the ground beef and pork, onion, green pepper and carrot. Place about 2 tablespoons of the meat mixture along the center of the wrapper. The filling should be no bigger around than your thumb or the wrapper will burn before the meat is cooked. Fold one edge of the wrapper over to the other. Fold the outer edges in slightly, then continue to roll into a cylinder. Wet your finger, and moisten the edge to seal. Repeat with the remaining wrappers and filling, keeping finished lumpias covered to prevent drying. This is a good time to recruit a friend or loved one to make the job less repetitive!!",
      "Step 3: Heat oil in a 9 inch skillet at medium to medium high heat until oil is 365 to 375 degrees F (170 to 175 degrees C) Fry 3-4 lumpia at a time. It should only take about 2-3 minutes for each side. The lumpia will be nicely browned when done. Drain on paper towels.",
      "Step 4: You can cut each lumpia into thirds for parties, if you like. In the Philippines, lumpia was eaten with banana ketchup, but I've never seen it sold in America.",
      "Step 5: We have determined the nutritional value of oil for frying based on a retention value of 10% after cooking. The exact amount may vary depending on cook time and temperature, ingredient density, and the specific type of oil used."
    ]
  },
  {
    "link": "https://www.allrecipes.com/recipe/262439/sinigang-na-bangus-filipino-milkfish-in-tamarind-broth/",
    "name": "Sinigang na Bangus (Filipino Milkfish in Tamarind Broth)",
    "ingredients": [
      "5 cups water",
      "2  onions, sliced",
      "2  tomatoes, sliced",
      "1 pound milkfish (bangus), cut into 5 pieces",
      "2 small eggplants, sliced 1/8-inch thick",
      "1 cup fresh green beans, cut into 1-inch pieces",
      "2  white radishes (labanos), sliced",
      "5 pods okra, sliced",
      "3  small green chile peppers",
      "1 cup watercress (kangkong) leaves and stems",
      " 1/2 cup tamarind powder",
      "1 pinch salt to taste"
    ],
    "instructions": [
      "Step 1: Pour water into a pot. Add onions and tomatoes, cover, and bring to a boil. Add milkfish, eggplants, beans, radishes, okra, and green chile peppers. Boil for 5 minutes. Stir in watercress and tamarind powder. Cover, reduce heat, and season with salt. Boil for 5 minutes until fish is cooked through."
    ]
  },
  {
    "link": "https://www.allrecipes.com/recipe/71067/siopao-filipino-steamed-dumplings/",
    "name": "Siopao (Filipino Steamed Dumplings)",
    "ingredients": [
      "1 tablespoon active dry yeast",
      "1  1/2 cups lukewarm water",
      " 1/4 cup white sugar",
      "4  1/2 cups rice flour, divided",
      " 1/2 cup solid vegetable shortening, divided",
      "1 teaspoon vegetable oil",
      "1 large onion, diced",
      "1 clove garlic, chopped, or to taste",
      "1  1/2 pounds shredded cooked chicken meat",
      " 1/4 cup soy sauce",
      "2 teaspoons white sugar",
      " 1/2 cup diced green onion",
      "1 pinch salt and black pepper to taste",
      "1 teaspoon cornstarch, if needed (Optional)"
    ],
    "instructions": [
      "Step 1: Dissolve yeast in the water; stir in the sugar and beat in 2 1/2 cups of rice flour to make a soft sponge. Set aside in a warm place to double in bulk, about 40 minutes. Mix in 2 more cups of rice flour and 1/4 cup of shortening and place the dough on a greased work surface; knead in the remaining 1/4 cup of shortening to make a smooth dough. Cut the dough into 15 equal-sized pieces; form each piece into a ball.",
      "Step 2: Heat the vegetable oil in a skillet over medium heat; cook and stir the onion and garlic in the hot oil until translucent, about 5 minutes. Stir in the chicken, soy sauce, 2 teaspoons of sugar, green onion, salt, and pepper. If the mixture is juicy, add cornstarch to thicken.",
      "Step 3: Working on a lightly greased work surface, flatten a dough ball into a circle about 4 inches in diameter with the heel of your hand. Place about 1 tablespoon of filling into the center of the dough ball, bring the edges of the dough together at the top, and pinch and twist to seal in the filling. Place each filled dumpling onto waxed paper with the pinched seal at the bottom while you finish the rest of the dumplings.",
      "Step 4: Spray a multi-layered bamboo steamer with cooking spray, place the steamer on top of a large saucepan, and pour in water to several inches below the steamer. Bring the water to a boil.",
      "Step 5: Working in several batches, place 3 or 4 filled buns into each steamer layer without letting the buns touch each other or the edge of the steamer, cover the steamer, and let the buns steam over medium-low heat until puffy and the dough is springy, about 15 minutes per batch. Serve warm."
    ]
  },
  {
    "link": "https://www.allrecipes.com/recipe/263028/filipino-steamed-rice-cebu-style/",
    "name": "Filipino Steamed Rice, Cebu Style",
    "ingredients": [
      "1 pound pork belly, cut into 3/4-inch cubes"
    ],
    "instructions": [
      "Step 1: Mix pork belly with cooking wine, oyster sauce, cornstarch, sesame oil, salt, and black pepper in a bowl. Marinate in the refrigerator, at least 20 minutes.",
      "Step 2: Heat vegetable oil in a pot over medium-high heat. Add garlic and shallots; cook and stir until fragrant, about 1 minute. Add the pork pieces; fry until browned, about 6 minutes. Pour in water, light soy sauce, and dark soy sauce. Cover with a lid and bring stew to a boil. Reduce heat to medium and cook until pork becomes tender and water is reduced by half, about 30 minutes.",
      "Step 3: Cut shrimp into 3/4-inch pieces. Mix cornstarch and water together in a bowl.",
      "Step 4: Bring stew to a boil. Add the shrimp and peas; cook until shrimp changes color, about 2 minutes. Quickly stir in the cornstarch mixture. Cook and stir until gravy is thickened, 7 to 10 minutes.",
      "Step 5: Heat oil in a wok over medium-high heat. Saute garlic until fragrant, about 1 minute. Increase heat to high. Add rice; cook, breaking up the rice with a spatula, until loosened, 3 to 5 minutes. Add oyster sauce and soy sauce. Cook and stir until rice is fluffy and heated through, about 3 minutes. Add remaining sesame oil.",
      "Step 6: Divide fried rice between 3 or 4 bowls. Portion the pork and shrimp stew equally over the rice."
    ]
  },
  {
    "link": "https://www.allrecipes.com/recipe/14756/filipino-ribs/",
    "name": "Filipino Ribs",
    "ingredients": [
      "6 pounds pork spareribs",
      "2 medium onions, cut into wedges",
      "1 medium onion, finely chopped",
      "6 tablespoons soy sauce",
      " 1/4 teaspoon ground black pepper",
      "6  whole star anise pods",
      "1 tablespoon vegetable oil",
      "1 tablespoon grated fresh ginger",
      " 1/2 cup honey",
      "2 tablespoons brown sugar",
      "1 tablespoon Worcestershire sauce",
      "1 tablespoon lemon juice"
    ],
    "instructions": [
      "Step 1: Place ribs in a 5 to 6 quart stock pot with the 2 wedged onions, 4 tablespoons of the soy sauce, pepper and star anise. Bring all to a boil. Reduce heat to medium low, cover and let simmer in meat juices until ribs are tender when pierced, about 1 1/4 hours. Stir occasionally.",
      "Step 2: Meanwhile, heat oil in a medium skillet over medium heat. Add remaining chopped onion and saute, stirring often, until onion is soft. Blend in the ginger, honey, sugar, Worcestershire sauce, lemon juice and remaining 2 tablespoons of soy sauce. Cook all together, stirring, until well blended. Remove from heat.",
      "Step 3: Preheat oven to 400 degrees F (200 degrees C).",
      "Step 4: Using tongs, remove ribs from stock pot and arrange in a single layer in an 11x16 inch baking dish. Brush evenly with the honey mixture and bake in the preheated oven, basting often with pan drippings, about 30 minutes or until ribs are well glazed."
    ]
  },
  {
    "link": "https://www.allrecipes.com/recipe/277700/instant-pot-filipino-chicken-adobo/",
    "name": "Instant Pot Filipino Chicken Adobo",
    "ingredients": [
      " 1/2 cup distilled white vinegar",
      " 1/4 cup soy sauce",
      "2 tablespoons minced garlic",
      "1 tablespoon olive oil",
      "1 tablespoon brown sugar",
      "1 teaspoon black peppercorns, roughly cracked",
      "2  bay leaves",
      "1 large onion, sliced",
      "1  1/2 pounds bone-in, skin-on chicken thighs",
      "1 tablespoon chopped scallions"
    ],
    "instructions": [
      "Step 1: Whisk together vinegar, soy sauce, garlic, olive oil, brown sugar, and crushed peppercorns in a medium bowl until sugar is dissolved. Stir in bay leaves.",
      "Step 2: Line the bottom of a multi-functional pressure cooker (such as Instant Pot) with onion slices. Place chicken thighs over onion and pour vinegar mixture over the top. Close and lock the lid.",
      "Step 3: Select high pressure according to manufacturer's instructions; set the timer for 10 minutes. Allow 10 minutes for pressure to build.",
      "Step 4: Line a baking sheet with aluminum foil.",
      "Step 5: Release pressure using the quick-release method according to manufacturer's instructions, about 5 minutes. Unlock and remove the lid. Using tongs, transfer chicken thighs to the prepared baking sheet, skin-side up. Select Saute function and cook until sauce thickens, 3 to 5 minutes.",
      "Step 6: Set an oven rack about 6 inches from the heat source and preheat the oven's broiler to high.",
      "Step 7: Cook chicken under the preheated broiler until skin is crispy, 6 to 8 minutes. Transfer chicken to a serving plate and spoon sauce over the top. Garnish with scallions."
    ]
  },
  {
    "link": "https://www.allrecipes.com/recipe/212993/pochero/",
    "name": "Pochero",
    "ingredients": [
      "3 tablespoons olive oil",
      "2  plantains, peeled and quartered",
      "2 small potatoes, quartered",
      "1  onion, chopped",
      "2 cloves garlic, minced",
      "4 pounds chicken legs, thighs, and wings",
      "2 (4 ounce) links chorizo de bilbao (spicy Spanish semi-cured sausage), quartered",
      "salt and pepper to taste",
      "water to cover",
      "2  tomatoes, diced",
      "1 (15.5 ounce) can garbanzo beans, drained",
      "1 small head cabbage, chopped"
    ],
    "instructions": [
      "Step 1: Heat the olive oil in a large pot over medium heat; fry the plantains and potatoes in the hot oil until crisp on the outside, 5 to 7 minutes. Remove from the pot and set aside, keeping the oil in the pot.",
      "Step 2: Cook and stir the onion and garlic in the hot oil until the onion is translucent, 5 to 7 minutes. Add the chicken and chorizo; season with salt and pepper. Cover the pot and cook for 5 minutes.",
      "Step 3: Pour enough water over the chicken to cover completely; bring to a simmer and cook for 10 minutes. Add the tomatoes, cover, and cook another 10 minutes. Stir the plantains, potatoes, garbanzo beans, and cabbage into the mixture. Cook covered until the cabbage is wilted and everything is hot, about 5 minutes more. Serve hot."
    ]
  },
  {
    "link": "https://www.allrecipes.com/recipe/212924/filipino-baked-milkfish-baked-bangus/",
    "name": "Filipino Baked Milkfish (Baked Bangus)",
    "ingredients": [
      "2 pounds whole milkfish (bangus), or more to taste",
      "1  tomato, diced",
      "1  onion, chopped",
      "1 (2 inch) piece ginger, thinly sliced crosswise, or to taste, divided",
      "salt and ground black pepper to taste",
      "4  calamansi, juiced",
      " 1/2 cup soy sauce",
      "2 cloves garlic, chopped"
    ],
    "instructions": [
      "Step 1: Preheat the oven to 350 degrees F (175 degrees C). Line a roasting pan with enough aluminum foil to cover the whole bangus.",
      "Step 2: Remove scales and gills from bangus. Wash the innards. Pat fish dry with a paper towel.",
      "Step 3: Mix tomato, onion, and 1/3 of the ginger together in a bowl. Season with salt and pepper. Cut open the front side of the fish and fill with the tomato mixture. Place fish in the prepared pan.",
      "Step 4: Mix calamansi juice, soy sauce, garlic, and remaining ginger in a separate bowl. Pour over the fish in the pan. Fold foil over the fish and seal all ends.",
      "Step 5: Bake in the preheated oven until fish flakes easily with a fork, about 60 minutes.",
      "Step 6: Nutrition data for this recipe includes the full amount of soy sauce. The actual amount of soy sauce consumed will vary."
    ]
  },
  {
    "link": "https://www.allrecipes.com/recipe/212954/filipino-fish-escabeche/",
    "name": "Filipino Fish Escabeche",
    "ingredients": [
      "1 cup oil for frying",
      "1 (4 ounce) whole tilapia, cleaned and scaled",
      "salt to taste",
      "3 tablespoons olive oil",
      "1  onion, chopped",
      "2 cloves garlic, minced",
      "1  red bell pepper, cut into chunks",
      "1 (1 inch) piece ginger, thinly sliced crosswise, or to taste",
      "1  1/4 cups water",
      "1 cup distilled white vinegar",
      "5 tablespoons white sugar",
      "salt and ground black pepper to taste",
      "1 tablespoon cornstarch"
    ],
    "instructions": [
      "Step 1: Heat oil in a deep fryer or large saucepan to 350 degrees F (175 degrees C).",
      "Step 2: Pat tilapia dry with a paper towel. Cut 2 to 3 slits on either side of fish; sprinkle salt on top. Fry in hot oil until browned, about 2 minutes per side.",
      "Step 3: Heat olive oil in a skillet over medium-high heat. Saute onion and garlic until onion is translucent, about 5 minutes. Add red bell pepper and ginger; saute until fragrant, about 2 minutes.",
      "Step 4: Mix water, vinegar, and sugar together in a bowl. Pour into onion mixture in the skillet. Cover and bring to a boil. Cook until slightly reduced, about 2 minutes. Season with salt and pepper. Add cornstarch. Boil, stirring often, until sauce is thickened, about 5 minutes. Pour sauce over fish.",
      "Step 5: We have determined the nutritional value of oil for frying based on a retention value of 10% after cooking. Amount will vary depending on cooking time and temperature, ingredient density, and specific type of oil used."
    ]
  },
  {
    "link": "https://www.allrecipes.com/recipe/277279/bistek-filipino-beef-steak/",
    "name": "Bistek (Filipino Beef Steak)",
    "ingredients": [
      " 1/2 cup soy sauce (such as Kikkoman(r))",
      " 1/4 cup lime juice",
      "3 cloves garlic, smashed",
      "2 teaspoons white sugar",
      "1 teaspoon fish sauce (Optional)",
      "ground black pepper to taste",
      "1 pound beef steak, sliced 1/4-inch thick",
      "2 tablespoons vegetable oil, divided, or as needed",
      "4  potatoes, cut into wedges (Optional)",
      "1 large onion, cut into rings",
      " 1/8  cup water (Optional)"
    ],
    "instructions": [
      "Step 1: Combine soy sauce, lime juice, garlic, sugar, fish sauce, and pepper in a bowl. Taste and adjust to your liking. Add sliced beef, making sure it is coated evenly. Marinate for at least 30 minutes or up to 1 hour.",
      "Step 2: Heat 1 tablespoon oil in a wok or pan over medium-high heat. Fry potatoes in the hot oil until the edges turn golden brown, 7 to 10 minutes. Transfer to a plate.",
      "Step 3: Heat remaining oil in the same pan over medium-high heat and fry onions until edges turn brown, 7 to 10 minutes. Transfer to the same plate.",
      "Step 4: Heat the same pan over medium-high heat. Reserve marinade and fry beef in batches, adding more vegetable oil if necessary, until browned and no longer pink in the centers, 5 to 7 minutes. Transfer to the plate and continue with remaining beef.",
      "Step 5: Pour reserved marinade into the pan with water to deglaze, scraping up browned bits from the bottom of the pan using a wooden spoon. Taste and adjust seasonings. Return beef back to the pan with some onion, leaving remaining onion for garnish; reduce heat and let simmer until sauce has thickened, 7 to 10 minutes.",
      "Step 6: Slide beef and sauce onto a serving plate. Garnish with remaining onion. Place potatoes on the side and serve."
    ]
  },
  {
    "link": "https://www.allrecipes.com/recipe/138109/philippine-longanisa-de-eugenio-sweet-sausage/",
    "name": "Philippine Longanisa de Eugenio (Sweet Sausage)",
    "ingredients": [
      " 1/2 cup white sugar",
      "1 teaspoon dried oregano",
      " 1/4 teaspoon ground ginger",
      " 1/2 teaspoon ground pepper",
      "4  1/2 teaspoons fine salt",
      " 1/2 teaspoon curing salt (Prague powder #1)",
      "1 tablespoon minced garlic",
      "2 pounds ground pork",
      "1 pound coarse ground pork back fat",
      " 1/4 cup distilled white vinegar",
      "Hog casing, rinsed well"
    ],
    "instructions": [
      "Step 1: In a small bowl, stir together sugar, oregano, ginger, pepper, salt, and curing salt until evenly combined; set aside. Mix together garlic, ground pork, and ground pork fat in a large bowl until combined. Sprinkle with spice mixture, pour in white vinegar, and mix thoroughly.",
      "Step 2: Rinse the sausage casings very well until all of the salt or brine is gone; tie a knot at one end of the casing, then thread the other end onto a sausage stuffing tube. Stuff the casing with the sausage mixture, twisting the filled casing every 2 1/2 to 4 inches to form links. Once all of the sausage mixture has been used, tie the end of the last link.",
      "Step 3: Using fine cotton kitchen twine, tie the ends of each sausage link tightly, then cut between each link to separate. Place into a glass or plastic container, cover, and allow to mature in the refrigerator for 4 days, after which point they may be frozen.",
      "Step 4: To cook the longanisa, fill a skillet with 1/2 to 3/4 inches of water and add thawed sausages. Simmer over medium-high heat until the water evaporates, about 20 minutes. Uncover, and allow the sausages to fry in their own oil until golden brown, about 8 minutes more."
    ]
  },
  {
    "link": "https://www.allrecipes.com/recipe/98629/authentic-filipino-pancit/",
    "name": "Authentic Filipino Pancit",
    "ingredients": [
      "4  boneless chicken thighs",
      "1 (8 ounce) package dried rice noodles",
      "2 tablespoons soy-based liquid seasoning (such as Maggi(r)), or to taste",
      "3 tablespoons olive oil, divided",
      "1 tablespoon sesame oil",
      "3 cloves garlic, chopped",
      "1 medium onion, chopped",
      " 1/2 large head cabbage, thinly sliced",
      "2  carrots, julienned",
      "1 teaspoon garlic salt"
    ],
    "instructions": [
      "Step 1: Bring a pot of water to a boil over high heat. Add chicken thighs and boil until no longer pink in the centers and juices run clear, about 30 minutes. Strain broth into a bowl to reserve. Shred chicken thighs using 2 forks.",
      "Step 2: Place noodles in a large bowl and pour in hot chicken broth, adding hot water to cover if needed. Set aside until noodles are softened, 5 to 7 minutes. Blanch noodles with cold water and drain well. Place into a bowl and add soy seasoning, 1 tablespoon olive oil, and sesame oil. Mix well and set aside.",
      "Step 3: Heat remaining olive oil in a skillet or large wok over medium-high heat. Saute garlic in the hot oil until it begins to brown, about 1 minute. Add onion and cook for 2 minutes. Add chicken, cabbage, and carrots. Stir-fry for 3 to 4 minutes; season with garlic salt. Mix chicken mixture with noodles, add soy seasoning to taste, and serve."
    ]
  },
  {
    "link": "https://www.allrecipes.com/recipe/263852/filipino-corned-beef-and-cabbage/",
    "name": "Filipino Corned Beef and Cabbage",
    "ingredients": [
      " 1/3  cup butter",
      "1 teaspoon olive oil",
      " 1/2  onion, chopped",
      "3 cloves garlic, minced",
      "4  Roma tomatoes, cubed",
      " 1/3  small head cabbage, cored and cut into strips",
      " 1/4 cup chicken stock, or more to taste",
      "1 (12 ounce) can corned beef"
    ],
    "instructions": [
      "Step 1: Heat butter and oil in a large pot over medium heat. Add onion and garlic and cook until onion is soft and translucent, about 5 minutes. Add tomatoes and heat through, about 3 minutes.",
      "Step 2: Stir in cabbage and and cook until softened, about 5 minutes. Add a splash of chicken stock and heat through, about 3 minutes.",
      "Step 3: Mix in corned beef and cook until heated through and flavors have combined, about 10 minutes."
    ]
  },
  {
    "link": "https://www.allrecipes.com/recipe/152243/lolahs-chicken-adobo/",
    "name": "Lolah's Chicken Adobo",
    "ingredients": [
      "3 tablespoons vegetable oil",
      "3 pounds boneless, skinless chicken thighs, rinsed and patted dry",
      "6 cloves garlic, peeled and thinly sliced",
      " 1/2 cup soy sauce",
      " 1/2 cup apple cider vinegar",
      " 1/2 cup water",
      "2 tablespoons pickling spice, wrapped in cheesecloth"
    ],
    "instructions": [
      "Step 1: Heat oil in a large pot over medium heat until oil is shimmering. Cook garlic in oil for no more than 30 seconds. Add all of the chicken to the pot; cook, stirring frequently, until chicken is white all over. Do not brown.",
      "Step 2: Pour in soy sauce, vinegar, and water, and add the pickling spice. Make sure the spice ball is submerged. Bring to a boil, reduce heat to simmer, and place lid on pot so that some steam can escape. Simmer for 1 hour, or until chicken is very tender."
    ]
  },
  {
    "link": "https://www.allrecipes.com/recipe/45580/grilled-chicken-adobo/",
    "name": "Grilled Chicken Adobo",
    "ingredients": [
      "1  1/2 cups soy sauce",
      "1  1/2 cups water",
      " 3/4 cup vinegar",
      "3 tablespoons honey",
      "1  1/2 tablespoons minced garlic",
      "3  bay leaves",
      " 1/2 teaspoon black pepper",
      "3 pounds skinless, boneless chicken thighs"
    ],
    "instructions": [
      "Step 1: Preheat an outdoor grill for high heat, and lightly oil grate.",
      "Step 2: In a large pot, mix soy sauce, water, vinegar, honey, garlic, bay leaves, and pepper. Bring the mixture to a boil, and place the chicken into the pot. Reduce heat, cover, and cook 35 to 40 minutes.",
      "Step 3: Remove chicken, drain on paper towels, and set aside. Discard bay leaves. Return the mixture to a boil, and cook until reduced to about 1 1/2 cups.",
      "Step 4: Place chicken on the prepared grill, about 5 minutes on each side, until browned and crisp. Serve with the remaining soy sauce mixture."
    ]
  },
  {
    "link": "https://www.allrecipes.com/recipe/76455/pork-and-chicken-adobo/",
    "name": "Pork and Chicken Adobo",
    "ingredients": [
      "1  1/4 pounds boneless pork loin roast, cut into 2-inch pieces",
      "1  1/4 pounds boneless, skinless chicken thighs, trimmed and cut into 2-inch pieces",
      "2 tablespoons crushed garlic",
      "2  bay leaves, torn",
      "freshly ground black pepper",
      "1 cup white vinegar",
      " 1/4 cup soy sauce",
      "1 tablespoon vegetable oil",
      "2 cloves garlic, smashed"
    ],
    "instructions": [
      "Step 1: Place pork and chicken into a stock pot. Rub with crushed garlic and torn bay leaf, season lightly with pepper, and coat with vinegar and soy sauce. Cover, and marinate in the refrigerator at least 2 hours or overnight.",
      "Step 2: Bring meat and marinating liquid to a boil in a cast iron casserole or Dutch oven. Reduce heat to a simmer and cook until meat is tender, about 30 minutes. If necessary, add water to prevent sauce from drying out.",
      "Step 3: Strain liquid from meat and set aside; discard bay leaves. Heat 1 tablespoon oil in a large skillet over medium-high heat. Brown the pork and chicken on all sides; reduce heat and stir in remaining 2 cloves of smashed garlic. Cook and stir for 2 minutes more. Pour in reserved cooking liquid, and continue simmering until sauce is slightly thickened. Serve hot."
    ]
  },
  {
    "link": "https://www.allrecipes.com/gallery/the-best-filipino-chicken-recipes/",
    "name": "The 10 Best Filipino Chicken Recipes",
    "ingredients": [
      "Not available"
    ],
    "instructions": [
      "Step 1: There are so many reasons to love Filipino food. For one, it doesn't shy away from flavor. In many of these classic Filipino dishes, garlic, vinegar, and ginger team up to tantalize the tongue! We can't get enough of homestyle comfort foods like chicken adobo, pancit, afritada, and more. Give these top-rated chicken recipes a try!",
      "Step 2: Let's start with the national dish of the Philippines! Adobo is a simple but hearty Filipino dish, featuring chicken marinated in vinegar and soy sauce, then slowly cooked with garlic and spices. Serve over steamed white rice.",
      "Step 3: Ginataang Manok is a Filipino chicken dish flavored with ginger and coconut milk. \"Each family has their own version,\" says daplo. This is my mother's version. It's a rich dish that makes your kitchen smell so wonderful! Once my family smells the ginger frying and coconut milk simmering, they can't wait for it to be done so they can dig in!\"",
      "Step 4: Chicken legs and shiitake mushrooms simmer in chicken broth with bean thread noodles in this comforting Filipino noodle soup. \"Super tasty!\" raves JessicaRabbit0722. \"This was comfort food to me...similar to my Mom's. The older I get the more I want to learn Filipino recipes for my daughter to eat. A little time consuming but worth it. I will have to try it with cabbage and carrots next time. I like my veggies. Also my mom adds ginger to her recipe.\"",
      "Step 5: \"Typically cooked on the stove top, this yummy comfort food is straight from the Philippines, but cooked in the slow cooker for ease!\" says Jennifer Lee Kirk. \"Serve over rice.\"",
      "Step 6: This thick Filipino porridge features chicken wings and rice in a broth seasoned with onions, ginger, and garlic. \"This is the BEST Arroz Caldo recipe!\" says Lindsay Ceballos. \"It has become a staple in our house. I use regular white rice and whatever chicken I have on hand and it always comes out perfectly. It's quick easy and my kids practically eat the whole pot.\"",
      "Step 7: This savory Filipino stew is made with a whole chicken, tomatoes, and potatoes. \"This is a dish we make back in the Philippines,\" says candysweetemo. \"It's really delicious, and you can substitute pork for chicken or mix them both. Great over rice!\"",
      "Step 8: With this simple classic, rice noodles are tossed with stir-fried chicken, cabbage, garlic, onions, and carrots. \"Quick, Easy and delicious! Will remind you of Island Fiestas!\" says Heather Maurer.",
      "Step 9: Here's a slow cooker version of a classic tangy chicken dish from the Philippines, featuring chicken thighs, bok choy, apple cider vinegar, onion, and garlic.",
      "Step 10: \"The combination of chicken, prawns, and ham in coconut milk with sweet rice and curry powder gives this Filipino dish its distinctive flavor,\" says lola.",
      "Step 11: \"This is a very tasty and easy-to-make Filipino chicken dish made with soy sauce, garlic, and vinegar,\" says HEART-OF-MIDLOTHIAN. \"I can just as easily double or triple the chicken in this recipe to serve guests at a party. Serve over rice with just a little of the sauce (not too much).\"",
      "Step 12: We're serving up and celebrating the biggest home-cooking trends from the most enthusiastic cooks we know: our community. We crunched the data from 1.2 billion annual Allrecipes.com visits and 2.5 billion annual page views. Then we dug even further, surveying Allrecipes cooks about what's in their carts and fridges, on their stovetops and tables, and on their minds. Filipino cuisine is just one of the topics they're most curious about. See more of the \"State of Home Cooking\" special report."
    ]
  },
  {
    "link": "https://www.allrecipes.com/recipe/115038/filipino-pork-adobo/",
    "name": "Filipino Pork Adobo",
    "ingredients": [
      "1 cup distilled white vinegar",
      "1 cup soy sauce",
      " 1/2 cup ketchup",
      "1 tablespoon minced garlic",
      "3  bay leaves",
      "1 teaspoon  fresh-ground black pepper",
      "2  1/2 pounds lean pork, cut into 1 inch cubes",
      "1 pound small green beans, trimmed (Optional)"
    ],
    "instructions": [
      "Step 1: Stir together the vinegar, soy sauce, ketchup, garlic, and bay leaves in a large saucepan. Add the cubed pork, and bring to a boil over high heat. Reduce heat to medium-low, cover, and simmer until the pork is tender, about 2 1/2 hours. Stir occasionally. If using the green beans, add them during the last half hour of cooking."
    ]
  },
  {
    "link": "https://www.allrecipes.com/recipe/212913/beef-asado/",
    "name": "Beef Asado",
    "ingredients": [
      "1 (4 pound) beef chuck roast, quartered",
      "salt and pepper to taste",
      "2 tablespoons cooking oil",
      "1  onion, diced",
      "2 cloves garlic, crushed",
      "2 large tomatoes, chopped",
      "1 tablespoon whole peppercorns, crushed",
      "1 (5 ounce) jar pitted Manzanilla olives",
      "1  onion, quartered",
      "2  bay leaves",
      "2  beef bouillon cubes",
      " 1/2 cup ketchup",
      "1 large red bell pepper, sliced",
      "4 small potatoes, peeled and quartered",
      "1 tablespoon corn flour (Optional)",
      "1 teaspoon water (Optional)"
    ],
    "instructions": [
      "Step 1: Season the beef with salt and pepper; set aside.",
      "Step 2: Heat the oil in a skillet over medium heat; cook the diced onion and garlic in the hot oil until softened, about 5 minutes. Transfer the onion and garlic to a 6-quart pot. Individually brown the beef chunks on all sides in the skillet and place in the pot. Add the tomatoes, crushed peppercorns, olives with their juice, quartered onion, bay leaves, and bouillon cubes to the pot; bring to a boil. Stir the ketchup into the mixture, reduce heat to medium-low, and simmer 1 hour.",
      "Step 3: Remove the beef from the pot and set aside. Add the red bell pepper to the mixture and continue simmering another 30 minutes.",
      "Step 4: While the mixture continues to simmer, heat 2 tablespoons oil in the skillet. Cook the potatoes in the oil until golden brown; immediately add to the simmering mixture.",
      "Step 5: Slice the meat against the grain and add to the pot; stir. Cook together another 5 minutes before serving. If the sauce is too thin, mix the corn flour and water together and stir into the sauce to thicken."
    ]
  },
  {
    "link": "https://www.allrecipes.com/recipe/279309/chicken-salpicao/",
    "name": "Chicken Salpicao",
    "ingredients": [
      "3 (4 ounce) skinless, boneless chicken breasts, cut into bite-sized cubes",
      " 1/2 teaspoon garlic salt",
      " 1/2 teaspoon ground black pepper",
      " 1/2 teaspoon paprika",
      "2 tablespoons olive oil",
      "5 cloves garlic, chopped",
      "1  1/2 tablespoons Worcestershire sauce",
      " 1/2 tablespoon soy-based liquid seasoning (such as Maggi)",
      "1  serrano pepper, sliced diagonally"
    ],
    "instructions": [
      "Step 1: Season chicken with garlic salt, black pepper, and paprika. Marinate for 15 minutes.",
      "Step 2: Heat oil in a pan over medium heat. Add garlic and saute until almost brown, about 1 minute. Add chicken and mix to keep garlic from burning. Add Worcestershire and liquid seasoning. Reduce heat and let simmer until chicken is almost no longer pink in the center, 5 to 7 minutes. Stir in serrano pepper and simmer for another 2 minutes. Transfer to a serving dish."
    ]
  },
  {
    "link": "https://www.allrecipes.com/recipe/212922/filipino-rice-arroz-valenciana/",
    "name": "Filipino Rice (Arroz Valenciana)",
    "ingredients": [
      "3 tablespoons olive oil",
      "1  onion, chopped",
      "2 cloves garlic",
      "2 teaspoons paprika",
      "2  1/4 pounds chicken legs, thighs, and wings",
      "1  1/2 cups sweet peas",
      "1 (7 ounce) can olives",
      "2 links chorizo de bilbao (spicy Spanish semi-cured sausage), or to taste",
      "salt and ground black pepper to taste",
      "2  tomatoes, diced",
      "1 cup water",
      "2 cups glutinous sweet rice (malagkit)",
      "1 (14 ounce) can coconut milk",
      "1  red bell pepper, sliced lengthwise",
      "2  hard-boiled eggs, sliced lengthwise"
    ],
    "instructions": [
      "Step 1: Heat olive oil in a skillet over medium-high heat. Saute onion and garlic until onion is translucent, about 5 minutes. Add paprika and mix well. Add chicken, sweet peas, olives, chorizo, salt, and pepper; mix thoroughly. Cover and cook until fragrant, about 5 minutes. Add tomatoes and cook until juices are released, about 5 minutes. Add water; cook until slightly reduced, about 5 minutes. Add sweet rice; mix well. Cover and cook until flavors blend, about 5 minutes.",
      "Step 2: Pour coconut milk into the skillet and bring to a boil. Cook until slightly reduced, about 5 minutes. Add red bell pepper. Cover and cook until rice is tender and chicken is no longer pink near the bone, about 10 minutes more. An instant-read thermometer inserted near the bone should read 165 degrees F (74 degrees C). Garnish with hard-boiled eggs.",
      "Step 3: Use any chicken pieces you prefer.",
      "Step 4: Any kind of olives will do."
    ]
  },
  {
    "link": "https://www.allrecipes.com/recipe/46302/grandma-nenas-lumpia-and-pancit/",
    "name": "Grandma Nena's Lumpia and Pancit",
    "ingredients": [
      "1 pound boneless, skinless chicken breast halves",
      "1 pound boneless pork sirloin, cut into 1/2 inch cubes",
      " 1/2 head cabbage, shredded",
      "4  carrots, diced",
      " 1/2 teaspoon salt, or to taste",
      " 1/2 teaspoon ground black pepper, or to taste",
      "2 pinches monosodium glutamate (MSG) (Optional)",
      " 1/8  cup all-purpose flour",
      " 1/8  cup water",
      "30  spring roll wrappers",
      "1 quart oil for frying",
      "1 (8 ounce) package dry pancit (Canton) noodles",
      "1 cup apple cider vinegar",
      "4 cloves chopped garlic"
    ],
    "instructions": [
      "Step 1: Bring 2 quarts of water of water to a boil in a saucepan. Add chicken, and cook for 10 to 15 minutes, or until done. Reserve chicken stock, and allow chicken to cool. Cut chicken into small cubes.",
      "Step 2: In a large skillet or wok, saute pork until evenly brown. Stir in chicken, cabbage, and carrots. Cook over medium heat until cabbage is tender. Remove from heat, and allow to cool slightly while you separate the wrappers.",
      "Step 3: In small bowl, combine enough flour and water to make a paste about the consistency of glue. Spoon meat mixture into a thin line on each wrapper, and roll up, using a dab of the flour paste to seal the edge. Keep each lumpia thin; if you over fill them, the wrapper will tear. Save about 1/2 to 1/4 of the filling in the pot for the pancit.",
      "Step 4: Heat large skillet with 1/2 to 1 inch of oil. Fry the lumpia one side at a time, until a nice golden brown. Drain, standing each piece upright, in a pot or bowl lined with paper towel.",
      "Step 5: Return the remainder of the filling to the stove, and gently mix in the pancit noodles. Gradually add the chicken stock, and cook until noodles are tender.",
      "Step 6: For the sauce: With a mortar and pestle or back of a spoon, crush the garlic, then mix into the vinegar. Serve in small bowls with spoons. The sauce can be used as a dip, or to spoon into the lumpia.",
      "Step 7: We have determined the nutritional value of oil for frying based on a retention value of 10% after cooking. The exact amount may vary depending on cook time and temperature, ingredient density, and the specific type of oil used."
    ]
  },
  {
    "link": "https://www.allrecipes.com/recipe/166417/filipino-spaghetti/",
    "name": "Filipino Spaghetti",
    "ingredients": [
      "2 pounds spaghetti",
      "1 tablespoon vegetable oil",
      "1 head garlic, minced",
      "1  onion, chopped",
      "1 pound ground beef",
      "1 pound ground pork",
      "salt and pepper to taste",
      "1 (26.5 ounce) can spaghetti sauce",
      "1 (14 ounce) jar banana ketchup",
      " 1/4 cup white sugar",
      " 1/2 cup water",
      "1 pound hot dogs, sliced diagonally",
      " 1/2 cup shredded Cheddar cheese"
    ],
    "instructions": [
      "Step 1: Fill a large pot with lightly salted water and bring to a rolling boil over high heat. Once the water is boiling, stir in the spaghetti, and return to a boil. Cook the pasta uncovered, stirring occasionally, until the pasta has cooked through, but is still firm to the bite, about 12 minutes. Drain well in a colander set in the sink.",
      "Step 2: Heat the vegetable oil in a skillet over medium heat. Stir in the garlic and onion; cook and stir until the onion has softened and turned translucent, about 5 minutes. Stir in the beef and pork; season with salt and pepper. Cook and stir until the meat has browned. Pour in the spaghetti sauce, banana ketchup, sugar, and water. Simmer until the sauce has thickened, about 15 minutes. Stir in hot dog slices and continue to cook until hot dogs are heated through. Serve over spaghetti with Cheddar cheese sprinkled on top."
    ]
  },
  {
    "link": "https://www.allrecipes.com/recipe/212957/embutido-filipino-meatloaf/",
    "name": "Embutido (Filipino Meatloaf)",
    "ingredients": [
      "1  1/2 pounds ground pork",
      "1 (12 ounce) container fully cooked luncheon meat (such as SPAM(r)), sliced thin",
      "2 (4 ounce) links chorizo de bilbao (spicy Spanish semi-cured sausage), sliced thin",
      "2 tablespoons chopped sweet pickle",
      "1 (1.5 ounce) box raisins",
      "3  eggs, beaten",
      "1 teaspoon salt",
      "1 teaspoon ground black pepper",
      "2 tablespoons soy sauce, or to taste",
      "1 tablespoon cornstarch"
    ],
    "instructions": [
      "Step 1: Preheat the oven to 350 degrees F (175 degrees C).",
      "Step 2: Mix together ground pork, luncheon meat, chorizo de Bilbao, pickle, raisin, eggs, salt, and pepper in a large bowl. Form mixture into 2 logs and wrap with aluminum foil. Place wrapped logs in a baking dish.",
      "Step 3: Bake in the preheated oven for 1 hour. Set meatloaves aside to rest.",
      "Step 4: Carefully drain drippings from the baking dish into a small saucepan; place over medium heat. Stir soy sauce and cornstarch into drippings; bring to a boil. Cook and stir mixture at a boil until sauce is thick, 5 to 7 minutes.",
      "Step 5: Unwrap meatloaves and slice; serve sauce over sliced meatloaf."
    ]
  },
  {
    "link": "https://www.allrecipes.com/recipe/212999/filipino-pancit-bihon-with-canton/",
    "name": "Filipino Pancit Bihon with Canton",
    "ingredients": [
      " 1/2 (8 ounce) package pancit bihon (rice noodles)",
      "2 tablespoons olive oil",
      "1  onion, chopped",
      "2 cloves garlic, minced",
      "1 cup chopped cooked chicken",
      "salt and ground black pepper to taste",
      "2 cups fresh shrimp, peeled and deveined",
      "2 tablespoons soy sauce",
      "1 small head cabbage, shredded",
      "2 stalks celery, sliced",
      "1  carrot, peeled and cut into matchsticks",
      "2 cups water",
      " 1/2 (8 ounce) package pancit canton (yellow Chinese noodles)"
    ],
    "instructions": [
      "Step 1: Soak bihon in a bowl of warm water until soft, about 5 minutes. Drain.",
      "Step 2: Heat oil in a large wok over medium-high heat. Saute onion and garlic until onion is translucent, about 5 minutes. Add chicken, salt, and pepper. Cook and stir until flavors combine, about 3 minutes. Add shrimp; cook until they start to turn color, about 1 minute. Add soy sauce; toss in cabbage, celery, and carrot. Cook until well combined, about 2 minutes. Add 2 cups water; bring to a boil. Cook until vegetables begin to soften, about 2 minutes.",
      "Step 3: Transfer chicken, shrimp, and vegetables to a bowl, leaving the liquid behind in the wok. Add bihon and canton noodles to the liquid. Mix well and cover. Let sit until tender, about 5 minutes. Return 1/2 the chicken-vegetable mixture to the wok; mix with the noodles. Pour soup into bowls; garnish with the remaining chicken-vegetable mixture."
    ]
  },
  {
    "link": "https://www.allrecipes.com/recipe/276743/ginataang-alimasag-crabs-in-coconut-milk/",
    "name": "Ginataang Alimasag (Crabs in Coconut Milk)",
    "ingredients": [
      "2  whole Dungeness crabs",
      " 1/2 cup garlic oil",
      " 1/2 cup sliced garlic",
      "1  yellow onion, sliced",
      "1 cup thinly sliced ginger rounds, with skin on",
      " 1/2 cup bias-sliced scallions, whites only",
      "kosher salt and ground black pepper to taste",
      "1 tablespoon fish sauce",
      "1 (8.75 ounce) jar sauteed shrimp paste (such as Kamayan)",
      "5  Thai chiles, sliced into thin rings",
      "1  1/2 quarts coconut milk",
      " 1/2 quart water, or more as needed",
      "1 bunch fresh spinach",
      " 1/2 cup bias-sliced scallions, greens only"
    ],
    "instructions": [
      "Step 1: Bring a large pot of salted water to a boil. Drop crabs in and cook until shells turn bright red, 8 to 10 minutes. Plunge crabs into ice water to stop the cooking process. Drain and set aside.",
      "Step 2: Heat a large wok over medium-high heat and add garlic oil. Stir in garlic and cook until lightly toasted and golden brown, 2 to 3 minutes. Add onion and ginger and saute until onion is translucent, 4 to 5 minutes. Add scallion whites. Season with a few pinches of salt and pepper.",
      "Step 3: Add fish sauce and let infuse for 1 minute. Stir in shrimp paste and toast for about 3 minutes. Add Thai chiles; saute for 1 minute more. Pour in coconut milk and water. Bring to a simmer and reduce heat to medium-low. Cook until sauce is thickened, about 10 minutes, adding more water if too dry.",
      "Step 4: Meanwhile, break open the crab. Add to the sauce along with any accumulated juices. Simmer until flavors meld, 8 to 10 minutes more. Season with salt and pepper. Toss in spinach and let wilt. Garnish with scallion greens.",
      "Step 5: Crab can be substituted with kabocha squash, long beans, and shrimp."
    ]
  },
  {
    "link": "https://www.allrecipes.com/recipe/212915/barbecued-pork-kebabs/",
    "name": "Barbecued Pork Kebabs",
    "ingredients": [
      "1 cup white sugar",
      "1 cup soy sauce",
      "1  onion, diced",
      "5 cloves garlic, chopped",
      "1 teaspoon ground black pepper",
      "1 (4 pound) boneless pork loin, cut into 1 1/2-inch cubes",
      "10  bamboo skewers, soaked in water for 30 minutes"
    ],
    "instructions": [
      "Step 1: Whisk the sugar, soy sauce, onion, garlic and black pepper together in a large bowl. Add the pork and toss to coat. Cover and refrigerate at least 2 hours. Overnight is best if possible.",
      "Step 2: Preheat an outdoor grill for high heat, and lightly oil the grate.",
      "Step 3: Thread the pork onto the soaked skewers. Cook on the preheated grill until the pork is no longer pink in the center, 3 to 5 minutes per side."
    ]
  },
  {
    "link": "https://www.allrecipes.com/recipe/212965/crab-omelet/",
    "name": "Crab Omelet",
    "ingredients": [
      "2 tablespoons olive oil",
      "1 small potato, peeled and diced",
      "1  onion, chopped",
      "2 cloves garlic, minced",
      " 1/4 pound fresh crabmeat, drained and flaked",
      "salt and pepper to taste",
      "1 small tomato, diced",
      "1 (1.5 ounce) box raisins",
      " 1/4 cup peas",
      "1  red bell pepper, chopped",
      "3  eggs, beaten"
    ],
    "instructions": [
      "Step 1: Heat olive oil in a skillet over medium heat. Fry potato in hot oil until fork-tender, 5 to 7 minutes. Use a slotted spoon to transfer potatoes to a plate lined with paper towels, leaving excess oil in the skillet.",
      "Step 2: Return the skillet to medium heat. Cook onion and garlic in oil until tender, about 5 minutes. Add crab to the skillet and season with salt and pepper; stir. Cover the skillet and cook for 2 minutes. Stir tomatoes into mixture and cook another 2 minutes. Add raisins, peas, and red bell pepper; stir and cook another 2 minutes.",
      "Step 3: Pour eggs over mixture in the skillet. Cook until eggs set, 2 to 3 minutes. Flip omelet and cook 1 minute more. Transfer to a plate and serve hot with potatoes."
    ]
  },
  {
    "link": "https://www.allrecipes.com/recipe/212945/bringhe/",
    "name": "Bringhe",
    "ingredients": [
      "2 tablespoons olive oil",
      "1  onion, chopped",
      "2 cloves garlic, minced",
      "1 teaspoon curry powder",
      "2  chicken leg quarters, meat removed and cut into bite-sized pieces",
      " 1/2 pound tiger prawns, peeled and deveined",
      " 1/2 pound cubed fully cooked ham",
      "2  bay leaves",
      "salt and pepper to taste",
      "1 (16 ounce) can coconut milk",
      "1 cup uncooked glutinous white rice"
    ],
    "instructions": [
      "Step 1: Heat the olive oil in a large skillet over medium heat; cook and stir the onion and garlic in the hot oil until translucent, 5 to 7 minutes. Season with the curry powder and stir to evenly coat. Add the chicken and stir. Cover the skillet and cook for 2 minutes. Stir the prawns into the mixture and cook another 2 minutes. Add the ham and bay leaves; season with salt and pepper and mix thoroughly. Again cover the skillet and cook another 2 minutes.",
      "Step 2: Pour the coconut milk into the skillet. Add the rice and stir. Reduce heat to low and cover; cook, stirring occasionally, until the rice is tender, about 30 minutes. Serve hot."
    ]
  },
  {
    "link": "https://www.allrecipes.com/recipe/28363/adobo-chicken-with-ginger/",
    "name": "Adobo Chicken with Ginger",
    "ingredients": [
      "1 (3 pound) whole chicken, cut into 8 pieces",
      " 3/4 cup distilled white vinegar",
      " 1/2 cup soy sauce",
      "2 tablespoons thinly sliced fresh ginger root",
      " 1/2 tablespoon black peppercorns",
      "1 bulb garlic, peeled and crushed",
      "2  bay leaves"
    ],
    "instructions": [
      "Step 1: Combine chicken, vinegar, soy sauce, ginger, peppercorns, garlic, and bay leaves in a Dutch oven; bring to a boil over medium heat. Reduce heat, cover, and simmer for 30 minutes, basting chicken occasionally with the sauce.",
      "Step 2: Remove the lid and continue to simmer until liquid has reduced by half, 5 to 10 minutes. An instant-read thermometer inserted near the bone should read 165 degrees F (74 degrees C).",
      "Step 3: Transfer chicken to a serving plate. Strain liquid from the pot to remove bay leaves and other solids.",
      "Step 4: Serve chicken hot and drizzle with strained sauce."
    ]
  },
  {
    "link": "https://www.allrecipes.com/recipe/231544/authentic-chicken-adobo/",
    "name": "Authentic Chicken Adobo",
    "ingredients": [
      "2 cups coconut vinegar",
      " 1/2 cup soy sauce",
      "1 head garlic, peeled and coarsely chopped",
      "10  bay leaves",
      "1 tablespoon garlic powder",
      "1  1/2 teaspoons ground black pepper",
      "1  1/2 teaspoons annatto powder",
      "5  1/2 pounds cut-up chicken parts",
      "3 tablespoons vegetable oil, divided",
      "1 head garlic, peeled and coarsely chopped",
      "1  1/2 teaspoons annatto powder"
    ],
    "instructions": [
      "Step 1: Combine vinegar, soy sauce,1 head garlic, bay leaves, garlic powder, black pepper, and 1 1/2 teaspoons annatto powder in a large bowl. Add chicken, stir to coat with marinade, cover, and refrigerate for at least 4 hours.",
      "Step 2: Remove chicken from the marinade and pat dry. Reserve the marinade.",
      "Step 3: Heat 2 tablespoons vegetable oil in a large skillet over medium-high heat. Cook chicken in the hot oil until browned, about 4 minutes per side. Remove skillet from heat.",
      "Step 4: Heat 1 tablespoon vegetable oil in a small skillet over medium heat. Cook and stir 1 head garlic until browned, about 3 minutes. Add 1 1/2 teaspoons annatto powder; simmer for 3 minutes.",
      "Step 5: Pour annatto mixture over chicken and add reserved marinade. Bring to a simmer, cover, and cook until chicken is tender, about 45 minutes. Uncover and cook until sauce has reduced slightly, about 10 minutes."
    ]
  },
  {
    "link": "https://www.allrecipes.com/recipe/46402/pork-and-shrimp-pancit/",
    "name": "Pork and Shrimp Pancit",
    "ingredients": [
      "1 (6.75 ounce) package rice noodles",
      "5 tablespoons vegetable oil, divided",
      "1 small onion, minced",
      "2 cloves garlic, minced",
      " 1/2 teaspoon ground ginger",
      "1  1/2 cups cooked small shrimp, diced",
      "1  1/2 cups chopped cooked pork",
      "4 cups shredded bok choy",
      "3 tablespoons oyster sauce",
      " 1/4 cup chicken broth",
      " 1/4 teaspoon crushed red pepper flakes",
      "1  green onion, minced"
    ],
    "instructions": [
      "Step 1: Soak the rice noodles in warm water for 20 minutes; drain.",
      "Step 2: Heat 3 tablespoons oil in a wok or large heavy skillet over medium-high heat. Saute noodles for 1 minute. Transfer to serving dish, and keep warm. Add remaining 2 tablespoons oil to skillet, and saute onion, garlic, ginger, shrimp and pork for 1 minute.",
      "Step 3: Stir in bok choy, oyster sauce and chicken broth. Season with pepper flakes. Cover, and cook for 1 minute, or until bok choy is wilted. Spoon over noodles, and garnish with minced green onion."
    ]
  },
  {
    "link": "https://www.allrecipes.com/recipe/212971/clams-in-oyster-sauce/",
    "name": "Clams in Oyster Sauce",
    "ingredients": [
      "2 tablespoons olive oil",
      "1  onion, chopped",
      "2 cloves garlic, minced",
      "1 (2 inch) piece fresh ginger, peeled and grated",
      "2 tablespoons oyster sauce",
      " 1/2 cup water",
      "2  1/4 pounds clams in shell, scrubbed"
    ],
    "instructions": [
      "Step 1: Heat the oil in a large pot with a lid over medium heat. Cook the onion and garlic in the hot oil until fragrant, 3 to 5 minutes. Add the ginger to the mixture and cook another 2 minutes. Stir the oyster sauce into the mixture; cover and cook another 2 minutes. Pour the water into the mixture, cover, and cook another 2 minutes. Add the clams; cover and cook until the majority of the clams have opened, about 5 minutes. Discard any clams which do not open. Serve immediately."
    ]
  },
  {
    "link": "https://www.allrecipes.com/recipe/270709/air-fryer-lumpia/",
    "name": "Air Fryer Lumpia",
    "ingredients": [
      "1 tablespoon sesame oil",
      "1 pound ground pork",
      " 1/3  cup chopped water chestnuts",
      "3  green onions, chopped",
      "4 tablespoons reduced-sodium soy sauce",
      "2 tablespoons rice vinegar",
      "3 cups shredded cabbage",
      "2 large carrots, grated",
      "18  lumpia wrappers",
      "olive oil cooking spray"
    ],
    "instructions": [
      "Step 1: Heat oil in a large skillet over medium-high heat. Add pork and cook until browned, about 5 minutes, breaking it into small pieces. Add water chestnuts, green onion, soy sauce, and vinegar; cook for 5 additional minutes.",
      "Step 2: Increase heat to high and add cabbage. Cook until cabbage is soft and liquid has evaporated, about 2 minutes. Turn off heat and stir in grated carrots. Let mixture cool for 3 minutes.",
      "Step 3: Preheat the air fryer to 400 degrees F (200 degrees C).",
      "Step 4: Meanwhile, place a lumpia wrapper on a clean surface in a diamond shape, with one corner at the bottom. Place 2 tablespoons of filling in the wrapper. Fold up bottom half and then tightly fold in sides. Gently roll and seal with a couple drops of water. Repeat with remaining wrappers and filling.",
      "Step 5: Lightly mist each roll with olive oil. Arrange as many lumpia in your air fryer basket as possible without them touching. Cook in the preheated air fryer for 5 minutes. Flip and cook 3 additional minutes. Transfer to a paper towel-lined plate. Repeat with remaining lumpia.",
      "Step 6: This recipe appeared in Allrecipes Magazine and was modified to include minced garlic and grated fresh ginger in the filling."
    ]
  },
  {
    "link": "https://www.allrecipes.com/recipe/262431/pancit-sotanghon/",
    "name": "Pancit Sotanghon",
    "ingredients": [
      "1 (10.5 ounce) package mung bean vermicelli",
      "1 cup dried wood ear mushrooms (tenga ng daga)",
      "1 tablespoon vegetable oil",
      "1 clove garlic, minced",
      "1 small onion, chopped",
      " 1/2 teaspoon achiote powder",
      "1  3/4 cups chopped cooked chicken",
      "2 teaspoons soy sauce",
      "1 teaspoon fish sauce",
      "1 cube chicken bouillon",
      "1 cup water",
      "1 (8 ounce) package shredded cabbage",
      "1 small head bok choy, chopped",
      "1  carrot, chopped",
      " 1/4 teaspoon ground black pepper, or to taste",
      "1 pinch chili powder (Optional)",
      "2  hard-boiled eggs, sliced"
    ],
    "instructions": [
      "Step 1: Soak vermicelli in a bowl of hot water, 2 to 3 minutes. Drain. Cut noodles to desired length; set aside. Soak mushrooms in a second bowl of water; set aside to soften.",
      "Step 2: Heat oil in a saucepan over medium-high heat. Cook and stir garlic in hot oil until browned, about 2 minutes. Remove garlic to a bowl and set aside for garnish. Add onion and achiote powder to the saucepan and saute until onion is translucent, about 5 minutes. Add chicken, soy sauce, and fish sauce. Stir in bouillon until dissolved. Pour in 1 cup water and bring to a boil.",
      "Step 3: Drain softened mushrooms and cut into 1-inch pieces.",
      "Step 4: Toss cabbage, bok choy, and carrot into boiling water mixture. Add vermicelli, mushrooms, black pepper, and chili powder. Cook, mixing well, until pancit is slightly dried, about 5 minutes. Transfer pancit to a platter. Garnish with egg slices and browned garlic.",
      "Step 5: You can use chicken broth instead of water if desired."
    ]
  },
  {
    "link": "https://www.allrecipes.com/recipe/212997/pancit-molo-filipino-wonton-soup/",
    "name": "Pancit Molo (Filipino Wonton Soup)",
    "ingredients": [
      "1  1/2 pounds ground pork",
      "1 pound uncooked medium shrimp, peeled and deveined",
      "1 (8 ounce) can sliced water chestnuts, drained",
      "salt and ground black pepper to taste",
      "1 (16 ounce) package wonton wrappers, or as needed",
      "2 tablespoons olive oil",
      "1  onion, chopped",
      "2 cloves garlic, minced",
      "1  cooked chicken breast, shredded",
      "1  1/4 quarts chicken broth",
      "1 small head bok choy, cut into bite-sized pieces",
      "2  green onions, chopped"
    ],
    "instructions": [
      "Step 1: Mix pork, shrimp, water chestnuts, salt, and pepper together in a large bowl. Reserve 1/3 of the filling mixture for soup. Wrap about 1 tablespoon of remaining filling in a wonton wrapper. Repeat until all filling is used up.",
      "Step 2: Heat olive oil in a large pot over medium-high heat. Add onion and garlic; saute until onion is translucent, about 5 minutes. Stir in chicken and reserved filling. Mix well. Add chicken broth; season with salt and pepper. Bring to a boil. Drop filled wontons into soup one by one. Boil until wontons float to the top, 3 to 5 minutes. Add bok choy; boil until tender, about 2 minutes more. Garnish with green onions."
    ]
  },
  {
    "link": "https://www.allrecipes.com/recipe/277270/slow-cooker-filipino-chicken-adobo/",
    "name": "Slow Cooker Filipino Chicken Adobo",
    "ingredients": [
      "6 pounds skin-on, bone-in chicken thighs",
      "2 teaspoons whole black peppercorns",
      "12 cloves garlic, smashed and peeled",
      "4  bay leaves",
      " 1/2 cup soy sauce",
      "1 cup distilled white vinegar"
    ],
    "instructions": [
      "Step 1: Place chicken thighs, peppercorns, garlic, bay leaves, soy sauce, and vinegar into the bottom of a slow cooker in that order, making sure peppercorns and bay leaves are submerged into the liquid.",
      "Step 2: Cover and cook on High until chicken thighs are no longer pink in the centers, about 5 hours. An instant-read thermometer inserted near the bone of a thigh should read 165 degrees F (74 degrees C).",
      "Step 3: You can use 4 pounds skinless, boneless chicken thighs instead, if preferred."
    ]
  },
  {
    "link": "https://www.allrecipes.com/recipe/212953/salmon-sarciado/",
    "name": "Salmon Sarciado",
    "ingredients": [
      "3 tablespoons cooking oil, divided",
      "2  salmon steaks",
      "salt and pepper to taste",
      "1  onion, chopped",
      "2 cloves garlic, crushed",
      "2  tomatoes, diced",
      "1 large egg, beaten"
    ],
    "instructions": [
      "Step 1: Heat 2 tablespoons oil in a skillet over medium heat. Season salmon steaks with salt and pepper. Briefly fry salmon in hot oil until lightly cooked, about 2 minutes per side. Remove salmon to a plate and set aside.",
      "Step 2: Heat remaining 1 tablespoon oil in the skillet over medium heat. Cook onion and garlic in hot oil until fragrant, about 5 minutes. Stir in diced tomatoes and season with salt and pepper. Continue cooking until liquid from tomatoes makes a sauce, about 5 minutes more.",
      "Step 3: Return salmon to the skillet and simmer in tomato sauce until fish flakes easily with a fork, about 10 minutes. Stir beaten egg into sauce until incorporated; serve hot."
    ]
  },
  {
    "link": "https://www.allrecipes.com/recipe/58791/sati-babi/",
    "name": "Sati Babi",
    "ingredients": [
      "1 tablespoon ground coriander",
      "1 tablespoon cumin seed",
      " 3/4 teaspoon salt",
      " 1/2 teaspoon vegetable oil",
      " 1/8  teaspoon ground black pepper",
      "3 pounds pork butt roast, cut into 1 1/2-inch cubes",
      " 1/2 cup sliced onions",
      " 1/3  cup soy sauce",
      "1 tablespoon brown sugar",
      " 1/4 teaspoon ground ginger",
      "3  limes, cut into wedges"
    ],
    "instructions": [
      "Step 1: In a glass bowl or dish, mix together coriander, cumin, salt, oil, and pepper. Add pork cubes and stir to coat. Let stand for 20 minutes. Add onions, soy sauce, brown sugar, soy sauce, and ginger; stir to blend. Cover and refrigerate for at least 1 hour or overnight for best results.",
      "Step 2: Preheat an outdoor grill for high heat and lightly oil the grate. Thread pork cubes onto eight skewers. Discard onions.",
      "Step 3: Cook on the preheated grill, basting frequently with the remaining marinade. Turn occasionally until cooked through, about 15 minutes. Serve sprinkled with lime juice to taste. Discard any unused marinade.",
      "Step 4: Nutrition data for this recipe includes the full amount of marinade ingredients. The actual amount consumed will vary."
    ]
  },
  {
    "link": "https://www.allrecipes.com/recipe/270996/baked-siopao/",
    "name": "Baked Siopao (Filipino Meat Bun)",
    "ingredients": [
      "1 cup milk",
      "2 large eggs",
      " 1/2 cup vegetable oil",
      " 1/4 cup water",
      "4 cups all-purpose flour",
      "1 tablespoon active dry yeast",
      "1 pinch salt"
    ],
    "instructions": [
      "Step 1: Make dough: Heat milk in a microwave-safe container in the microwave until lukewarm but not scalding, 15 to 30 seconds. Pour lukewarm milk into a large bowl. Add eggs, oil, and water; mix well.",
      "Step 2: Mix together flour, yeast, and salt in a medium bowl. Stir into milk mixture until fully incorporated. Cover the bowl and let rest for 15 minutes.",
      "Step 3: Turn dough out onto a lightly floured surface. Knead until smooth and elastic, adding flour as needed if too sticky, about 5 minutes. Shape dough into a smooth ball by tucking folded ends under. Place into a clean bowl, cover, and let rise in a warm area until doubled in size, 1 to 1 1/2 hours.",
      "Step 4: Meanwhile, prepare filling: Place pork in a bowl with soy sauce, sugar, oyster sauce, cornstarch, and pepper. Mix well to combine.",
      "Step 5: Heat oil in a large skillet over medium heat. Cook and stir onion, garlic, and star anise in hot oil for 2 minutes. Add ground pork mixture; cook and stir until browned and crumbly, 4 to 5 minutes. Pour in water; reduce heat and let simmer, scraping the bottom of the pan occasionally until mixture is glazed but not soupy, about 10 minutes. Transfer filling to a bowl and refrigerate until dough is ready.",
      "Step 6: Preheat the oven to 100 degrees F (37 degrees C). Line a large baking sheet with parchment paper.",
      "Step 7: Portion dough into golf ball-sized pieces, about 2-inches in diameter. Arrange on the prepared baking pan with 1 to 2 inches between them. Flatten dough balls using your hand to 1/4-inch thickness or slightly larger than the palm of your hand. Put 1 tablespoon filling in the dough centers. Gather edges of dough at the top; twist and pinch to seal. Place each bun back on the prepared baking sheet.",
      "Step 8: Turn off the oven once it has reached temperature. Transfer buns on the baking sheet to the warm oven and let buns rest until doubled in size, about 30 minutes.",
      "Step 9: Preheat the oven to 325 degrees F (165 degrees C), leaving buns inside. Bake buns until bottoms are lightly browned, 12 to 15 minutes.",
      "Step 10: You can use a dough machine to make the dough. Start with the wet ingredients and use the Dough setting.",
      "Step 11: I like taking a photo of the dough before rising to compare it with the risen dough.",
      "Step 12: If the filling mixture is soupy after simmering, you can continue to simmer until the liquid has mostly evaporated or use a slotted spoon to strain the meat from the extra liquid."
    ]
  },
  {
    "link": "https://www.allrecipes.com/recipe/230047/duck-adobo/",
    "name": "Duck Adobo",
    "ingredients": [
      "6  duck legs",
      "salt and freshly ground black pepper to taste",
      "1 tablespoon vegetable oil",
      "1 large onion, sliced",
      "8 cloves garlic, minced",
      "1  1/2 cups chicken broth",
      "1 cup seasoned rice vinegar",
      " 1/2 cup soy sauce, or to taste",
      "2 teaspoons sambal chili paste, or other hot pepper sauce to taste",
      "2  bay leaves"
    ],
    "instructions": [
      "Step 1: Season duck legs with salt and black pepper.",
      "Step 2: Heat oil in a large, deep skillet over medium-high heat. Add duck legs, skin-side down, and cook until browned, 3 to 4 minutes per side. Transfer to a plate; drain all but 1 tablespoon fat from the skillet.",
      "Step 3: Cook onion in reserved duck fat over medium heat until it begins to turn translucent, 3 to 4 minutes. Add garlic; cook and stir until fragrant, 1 to 2 minutes. Stir in broth, vinegar, soy sauce, chili paste, and bay leaves; bring to a simmer.",
      "Step 4: Return duck legs to the skillet, loosely cover, and simmer until duck legs are tender and easily pierced with a fork, about 2 hours. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).",
      "Step 5: Uncover, increase the heat to high, and cook until the sauce is thick, about 5 minutes; season with salt and black pepper to taste. Discard bay leaves before serving.",
      "Step 6: You can substitute chicken or pork for the duck. If you do, you may just have to cook it a little less.",
      "Step 7: You can partially cover the pot with its lid or a lightly oiled piece of parchment paper."
    ]
  },
  {
    "link": "https://www.allrecipes.com/recipe/223588/slow-cooker-adobo-chicken-with-bok-choy/",
    "name": "Slow Cooker Adobo Chicken with Bok Choy",
    "ingredients": [
      "2  onions, sliced",
      "4 cloves garlic, smashed",
      " 2/3  cup apple cider vinegar",
      " 1/3  cup soy sauce",
      "1 tablespoon brown sugar",
      "1  bay leaf",
      "ground black pepper to taste",
      "8  skinless, bone-in chicken thighs",
      "2 teaspoons paprika",
      "1 large head bok choy, cut into 1-inch strips",
      "2  green onions, sliced thinly"
    ],
    "instructions": [
      "Step 1: Combine onions, garlic, apple cider vinegar, soy sauce, brown sugar, and bay leaf in slow cooker. Season with black pepper. Place chicken thighs atop mixture. Sprinkle paprika over chicken thighs.",
      "Step 2: Cover and cook on Low for 8 hours.",
      "Step 3: Switch slow cooker to High. Add bok choy to chicken mixture; cook another 5 minutes. Garnish with green onion."
    ]
  },
  {
    "link": "https://www.allrecipes.com/recipe/73000/leyleys-spicy-chicken-adobo-wings/",
    "name": "Leyley's Spicy Chicken Adobo Wings",
    "ingredients": [
      "3 pounds chicken wings, separated at joints, tips discarded",
      "1 cup distilled white vinegar",
      " 1/2 cup water",
      "2  bay leaves",
      "1 teaspoon whole or cracked black peppercorns",
      "1 medium onion, chopped",
      "2 jalapeno peppers",
      " 1/2 cup soy sauce, or to taste",
      "1 whole head garlic - a few cloves whole, the rest minced, divided"
    ],
    "instructions": [
      "Step 1: Bring a large pot of water to a boil. Add wings and boil for 5 to 8 minutes. Drain in a colander, run under warm water, then return to the dry pot. Add vinegar, water, bay leaves, peppercorns, onion, and jalapenos. Bring to a simmer, then simmer over low heat for 20 minutes.",
      "Step 2: Add soy sauce and simmer for another 10 to 15 minutes, or until the sauce has reduced by half. Transfer wings to a colander and set aside. Add whole garlic cloves to the liquid in the pan; simmer until the sauce has a syrupy consistency and the jalapenos have burst open, releasing all of their seeds into the reduction.",
      "Step 3: Heat a large nonstick skillet over medium heat. Add chicken wings and minced garlic. Cook and stir until garlic is tender and wings have browned, about 10 minutes. Return wings to the sauce to coat before serving.",
      "Step 4: You can use pork or a whole cut-up chicken instead of chicken wings."
    ]
  },
  {
    "link": "https://www.allrecipes.com/recipe/31799/pancit/",
    "name": "Pancit",
    "ingredients": [
      "1 (8 ounce) package thin rice noodles",
      " 1/2 pound skinless, boneless chicken legs, cut into bite-size pieces",
      " 1/2 pound pork tenderloin, cut into bite-size pieces",
      " 1/2 cup soy sauce",
      "ground black pepper, to taste",
      " 1/2 medium head cabbage, shredded",
      "2 carrots, shredded",
      "2 green onions, chopped into 1-inch pieces",
      " 1/2 pound shrimp, peeled and deveined"
    ],
    "instructions": [
      "Step 1: Place rice noodles in a large bowl and cover with warm water. When soft, cut into 4-inch lengths. Drain and set aside.",
      "Step 2: In a skillet over medium heat, brown chicken and pork until no pink shows. Season with soy sauce and pepper. Remove from skillet and set aside. Saute cabbage and carrots until tender. Stir in noodles, green onions, and shrimp. Cook for 4 to 5 minutes, stir in chicken and pork, and cook for 5 more minutes."
    ]
  },
  {
    "link": "https://www.allrecipes.com/gallery/the-best-filipino-pork-recipes/",
    "name": "The Best Filipino Pork Recipes",
    "ingredients": [
      "Not available"
    ],
    "instructions": [
      "Step 1: If you crave comfort food, and thrill to quick and easy preparations, Filipino recipes are for you. These pork dishes represent some of the best of Filipino cooking. And there's plenty to choose from. The Philippines are comprised of thousands of small islands -- so the idea of regional cooking doesn't even begin to explain the situation. Just about every cook has her own signature recipe for adobo, pancit, and other specialties. These are just some of our favorite Filipino recipes with pork as a primary player.",
      "Step 2: Sauteed noodles combine with shrimp, pork, and bok choy, flavored with onion, garlic, ginger, oyster sauce, and red pepper flakes. \"Delicious and easy!\" says Rayna Jordan.",
      "Step 3: Here's a classic Filipino soup with pork chops. \"Amazing!\" raves sd_cutie. \"Loved how the soup was salty and tangy! I think this is even better than the sinigang I had at a restaurant! I added baby bok choy instead of green beans.\"",
      "Step 4: Crispy fried Filipino egg rolls are filled with seasoned ground pork, onion, carrots, and celery. Make and freeze a big batch so they're always on hand. Bd.weld rates it 5 stars: \"This is by far the best lumpia recipe I have tried here on AR.\"",
      "Step 5: These Filipino pork kebabs are marinated in a tangy mixture of sugar, soy sauce, onion, garlic and black pepper. \"Very tasty, extremely tender and moist,\" says csshilling. \"I alternated with pineapple on the skewer. Will definitely make again.\"",
      "Step 6: \"Lechon is a national dish in the Philippines -- pork leg is roasted in the oven very slowly, resulting in very moist and tasty meat,\" says lola. \"It is served with Lechon Sauce for special occasions.\"",
      "Step 7: \"Pork spareribs are glazed with the sweet, tangy taste of the Philippines,\" says CHRISTYJ. \"One of the ingredients, star anise, is native to China; it is a star-shaped, dark brown pod that contains a pea-sized seed in each of its eight segments.\"",
      "Step 8: With this hearty Filipino soup, mung beans are simmered in chicken broth with prawns and diced pork. Nancy30 rates it 5 stars: \"Om my gosh --excellent! I've never cooked mung beans before, always just sprouted them. I had no idea how delicious they are -- they look like lentils when cooked but taste like black eye peas. May be one of my new favorite soups!\"",
      "Step 9: Chopped pork loin and shrimp are stir-fried and combined with lots of veggies: garlic, onions, tomatoes, zucchini, okra, green beans, eggplant, and bitter melon. \"I loved this dish!\" raves Ann Marie Natal. \"The blend of vegetables and cooking method used here resulted in a hearty dish. Very lovely flavors.\"",
      "Step 10: Elegant enough for special occasions, this Filipino stew features pork, liver, potatoes, garlic, and bell peppers cooked in a rich tomato base.",
      "Step 11: \"The combination of chicken, prawns, and ham in coconut milk with sweet rice and curry powder gives this Filipino dish distinctive flavor,\" says lola.",
      "Step 12: These Filipino empanadas are filled with ground pork, onions, peas, carrots, potato, and raisins. \"This pork filling can be made way ahead of time to shorten the preparation time for these Filipino empanadas,\" says lola. \"Use my recipe for empanada dough.\"",
      "Step 13: Lechon kawali, crispy pan-fried pork belly, is a tasty Filipino dish with flavors of garlic and bay leaves. \"This was very easy to make,\" says Frannie Moore. \"It turned out perfect!\"",
      "Step 14: We're serving up and celebrating the biggest home-cooking trends from the most enthusiastic cooks we know: our community. We crunched the data from 1.2 billion annual Allrecipes.com visits and 2.5 billion annual page views. Then we dug even further, surveying Allrecipes cooks about what's in their carts and fridges, on their stovetops and tables, and on their minds. Filipino cuisine is just one of the topics they're most curious about. See more of the \"State of Home Cooking\" special report."
    ]
  },
  {
    "link": "https://www.allrecipes.com/recipe/212938/pinoy-chicken-adobo/",
    "name": "Pinoy Chicken Adobo",
    "ingredients": [
      "5 pounds chicken legs and thighs, rinsed and patted dry",
      " 3/4 cup water",
      " 3/4 cup white vinegar",
      " 1/4 cup soy sauce",
      "1 teaspoon white sugar",
      "1  onion, chopped",
      "2 cloves garlic, crushed",
      "1 teaspoon whole black peppercorns, crushed",
      "2  bay leaves",
      "salt to taste"
    ],
    "instructions": [
      "Step 1: Place the chicken in a 6-quart pot. Pour the water, vinegar, and soy sauce over the chicken. Add the sugar, onion, garlic, peppercorns, and bay leaves to the pot; bring the mixture to a boil for 2 minutes. Reduce heat to low; simmer until the chicken is no longer pink at the bone and the juices run clear, about 30 minutes. An instant-read thermometer inserted into the thickest part of the thigh, near the bone should read 180 degrees F (82 degrees C). Remove the chicken from the pot and continue cooking the sauce until it thickens, about 10 minutes; season with salt.",
      "Step 2: Return the chicken to the pot, making sure the chicken is covered entirely by the sauce. Cook together until the chicken is reheated, about 3 minutes."
    ]
  },
  {
    "link": "https://www.allrecipes.com/recipe/277726/instant-pot-ginataang-salmon-filipino-salmon-in-coconut-milk/",
    "name": "Instant Pot® Ginataang Salmon (Filipino Salmon in Coconut Milk)",
    "ingredients": [
      "1 tablespoon vegetable oil",
      "3 drops sesame oil, or to taste",
      " 1/4 cup diced onion",
      "2  diced green onions, white and green parts",
      "1 teaspoon garlic powder",
      " 1/2 cup diced fresh tomato",
      "2 tablespoons fish sauce",
      "1 cup vegetable broth",
      "1 (11 ounce) salmon side, bones removed with pliers",
      "1 cup coconut milk",
      "1  1/2 cups broccoli florets",
      "1 cup chopped kale",
      " 1/2 teaspoon salt",
      " 1/4 teaspoon ground black pepper"
    ],
    "instructions": [
      "Step 1: Turn on a multi-functional pressure cooker (such as Instant Pot(r)) and select Saute function. Warm vegetable oil in pot, and add sesame oil. Add onion and green onions and saute for 1 minute. Add garlic powder; cook for 1 minute. Mix in diced tomato and pour in fish sauce; cook until heated through, about 2 minutes.",
      "Step 2: Add vegetable broth to the pot and place salmon on top of the liquid and vegetables. Select Cancel to turn off Saute mode, and close and lock the lid. Select high pressure according to manufacturer's instructions; set timer for 5 minutes. Allow 10 to 15 minutes for pressure to build.",
      "Step 3: Release pressure using the natural-release method according to manufacturer's instructions, 10 to 20 minutes. Remove lid. Pour in coconut milk, then add broccoli and kale. Mix vegetables gently around the side of salmon, but be careful not to break up the cooked salmon. Sprinkle salt and pepper over top. Replace lid and set vent to \"Sealing.\"",
      "Step 4: Select the Steam function and steam for 2 minutes. Release pressure by turning the seal to \"Venting.\" Remove lid.",
      "Step 5: Use a side of salmon weighing between 10 and 12 ounces. If you are using frozen salmon, set the timer during the High pressure cooking phase to 7 minutes.",
      "Step 6: You can use coconut milk or coconut cream, depending on your preference."
    ]
  },
  {
    "link": "https://www.allrecipes.com/recipe/212908/bopis/",
    "name": "Bopis",
    "ingredients": [
      " 1/2 pound pork liver",
      " 1/2 pound pork lung",
      " 1/2 pound pork heart, cut into bite-size pieces",
      "2  bay leaves",
      " 1/2 cup distilled white vinegar",
      " 1/2 cup water",
      "salt and pepper to taste",
      "3 tablespoons olive oil",
      "1  onion, chopped",
      "2 cloves garlic, minced",
      "2  tomatoes, diced"
    ],
    "instructions": [
      "Step 1: Place the pork liver and the pork lung in two separate pots and cover with water. Bring each pot to a boil; cook at a boil until tender, about 10 minutes. Drain both and allow to cool before chopping into bite-size pieces. Set aside.",
      "Step 2: Combine the liver, lung, and heart in a large pot over medium heat; add the bay leaves, vinegar, and water. Season with salt and pepper. Bring the mixture to a simmer and cook for 5 minutes.",
      "Step 3: Meanwhile, heat the olive oil in a large saucepan over medium heat; cook the onion and garlic in the hot oil until fragrant, about 5 minutes. Stir the tomatoes into the mixture and simmer 5 minutes. Pour the pork liver mixture from the pot into the saucepan; cook and stir together for 5 minutes more. Serve hot."
    ]
  },
  {
    "link": "https://www.allrecipes.com/recipe/278067/chicken-adobo-with-coconut-milk-adobo-sa-gata/",
    "name": "Chicken Adobo with Coconut Milk (Adobo sa Gata)",
    "ingredients": [
      "1  1/2 cups spiced cane vinegar",
      "1  1/2 cups soy sauce",
      " 3/4 cup brewed coffee",
      " 1/2 cup packed dark brown sugar",
      "2 tablespoons coconut oil",
      "8  chicken leg quarters",
      "1 tablespoon coarsely chopped garlic",
      " 1/3  cup minced shallots",
      " 1/4 cup minced garlic",
      "3 tablespoons whole black peppercorns",
      "6  bay leaves",
      "cheesecloth and kitchen string",
      " 1/2 pound fresh shiitake mushrooms, stems removed and caps thinly sliced",
      " 1/2 pound oyster mushrooms, sliced",
      "1  1/2 cups coconut cream",
      "2 tablespoons ground turmeric",
      "2  green onions, chopped"
    ],
    "instructions": [
      "Step 1: Whisk together vinegar, soy sauce, coffee, and brown sugar in a bowl until sugar is dissolved.",
      "Step 2: Heat coconut oil in an 8-quart Dutch oven over high heat. Working in batches, add chicken, skin sides down first, and cook until golden brown and crispy, about 4 minutes on each side. Transfer to a plate.",
      "Step 3: Drain all but 2 tablespoons drippings from Dutch oven and return to heat. Add chopped garlic and fry until light brown and crisp, about 3 minutes. Remove to a small bowl, leaving drippings in the pot. Add shallots and minced garlic; cook, stirring constantly, until shallots are translucent and garlic has browned, about 5 minutes.",
      "Step 4: Put peppercorns and bay leaves in a square of cheesecloth tied with kitchen string. Add browned chicken quarters, vinegar mixture, and spice bundle to Dutch oven. Bring to a boil; boil for 1 to 2 minutes. Reduce heat, cover, and simmer for 30 minutes. Add shiitake and oyster mushrooms, coconut cream, and turmeric. Cover and simmer until chicken is tender, 15 to 20 minutes more.",
      "Step 5: Cut leg quarters in half at joint or pull meat from bones and shred. Remove spice bundle and skim fat from sauce. Return chicken to the sauce. Sprinkle with green onions and the fried garlic.",
      "Step 6: Nutrition data for this recipe includes the full amount of cooking liquid. The actual amount of cooking liquid consumed will vary."
    ]
  },
  {
    "link": "https://www.allrecipes.com/recipe/244609/slow-cooker-chicken-afritad/",
    "name": "Slow Cooker Chicken Afritad",
    "ingredients": [
      "1 pound skinless, boneless chicken breast halves, cut into cubes",
      " 1/2 cup soy sauce, or to taste",
      " 1/2 cup olive oil, or to taste",
      "1  lemon, juiced",
      "3 cloves garlic, minced",
      "ground black pepper to taste",
      "2  tomatoes, cubed",
      "2  carrots, chopped",
      "3  red potatoes, cubed",
      "1  onion, sliced (Optional)",
      "1  green bell pepper, sliced",
      "1  red bell pepper, sliced",
      "1  yellow bell pepper, sliced",
      "1 cup green peas"
    ],
    "instructions": [
      "Step 1: Combine chicken, soy sauce, olive oil, lemon juice, garlic, and black pepper in a slow cooker; allow to marinate, 10 to 15 minutes.",
      "Step 2: Mix tomatoes, carrots, red potatoes, onion, green bell pepper, red bell pepper, yellow bell pepper, and peas into chicken mixture.",
      "Step 3: Cook on high for 3 to 4 hours (or on Low for 7 to 8 hours).",
      "Step 4: I usually cut the vegetables while the chicken is marinating.",
      "Step 5: You may add the tomatoes and peppers at the end of the cooking if you prefer them crispier.",
      "Step 6: Feel free to add soy sauce and pepper to taste."
    ]
  },
  {
    "link": "https://www.allrecipes.com/recipe/258134/lazy-longanisa-filipino-style-breakfast-sausage/",
    "name": "Lazy Longanisa (Filipino-Style Breakfast Sausage)",
    "ingredients": [
      "1 pound smoked kielbasa sausage, cut into thick slices",
      " 1/2 cup brown sugar",
      "4 teaspoons white vinegar",
      "1 tablespoon soy sauce",
      " 1/2 cup water",
      "1 tablespoon vegetable oil"
    ],
    "instructions": [
      "Step 1: Combine sliced sausage, brown sugar, white vinegar, and soy sauce in a large plastic bag. Seal and marinate in the refrigerate, 2 hours to overnight.",
      "Step 2: Pour sausage mixture into a large skillet over medium-high heat. Add water and vegetable oil; cook and stir until liquid is reduced and sausage is browned, about 15 minutes."
    ]
  }
]